Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/eth.h
/* -------- ETH_AXIMP : (ETH Offset: 0x1054) (R/W 32) AXI Max Pipeline -------- */
#define ETH_AXIMP_RESETVALUE                  _UINT32_(0x101)                                      /*  (ETH_AXIMP) AXI Max Pipeline  Reset Value */

#define ETH_AXIMP_AXIMWR_Pos                  _UINT32_(0)                                          /* (ETH_AXIMP) AXI Max write requests Position */
#define ETH_AXIMP_AXIMWR_Msk                  (_UINT32_(0xFF) << ETH_AXIMP_AXIMWR_Pos)             /* (ETH_AXIMP) AXI Max write requests Mask */
#define ETH_AXIMP_AXIMWR(value)               (ETH_AXIMP_AXIMWR_Msk & (_UINT32_(value) << ETH_AXIMP_AXIMWR_Pos)) /* Assigment of value for AXIMWR in the ETH_AXIMP register */
#define ETH_AXIMP_AXIMRR_Pos                  _UINT32_(8)                                          /* (ETH_AXIMP) AXI Max read requests Position */
#define ETH_AXIMP_AXIMRR_Msk                  (_UINT32_(0xFF) << ETH_AXIMP_AXIMRR_Pos)             /* (ETH_AXIMP) AXI Max read requests Mask */
#define ETH_AXIMP_AXIMRR(value)               (ETH_AXIMP_AXIMRR_Msk & (_UINT32_(value) << ETH_AXIMP_AXIMRR_Pos)) /* Assigment of value for AXIMRR in the ETH_AXIMP register */
#define ETH_AXIMP_Msk                         _UINT32_(0x0000FFFF)                                 /* (ETH_AXIMP) Register Mask  */


/* -------- ETH_RSCCTRL : (ETH Offset: 0x1058) (R/W 32) Receive side coalescing on queues 1-15 Enable -------- */
#define ETH_RSCCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_RSCCTRL) Receive side coalescing on queues 1-15 Enable  Reset Value */

#define ETH_RSCCTRL_RSCCTRLEN_Pos             _UINT32_(1)                                          /* (ETH_RSCCTRL) Enables Receive Side Coalescing Position */
#define ETH_RSCCTRL_RSCCTRLEN_Msk             (_UINT32_(0x7FFF) << ETH_RSCCTRL_RSCCTRLEN_Pos)      /* (ETH_RSCCTRL) Enables Receive Side Coalescing Mask */
#define ETH_RSCCTRL_RSCCTRLEN(value)          (ETH_RSCCTRL_RSCCTRLEN_Msk & (_UINT32_(value) << ETH_RSCCTRL_RSCCTRLEN_Pos)) /* Assigment of value for RSCCTRLEN in the ETH_RSCCTRL register */
#define ETH_RSCCTRL_RSCCTRLMSK_Pos            _UINT32_(16)                                         /* (ETH_RSCCTRL) Mask the clearing of the rsc_en bit Position */
#define ETH_RSCCTRL_RSCCTRLMSK_Msk            (_UINT32_(0x1) << ETH_RSCCTRL_RSCCTRLMSK_Pos)        /* (ETH_RSCCTRL) Mask the clearing of the rsc_en bit Mask */
#define ETH_RSCCTRL_RSCCTRLMSK(value)         (ETH_RSCCTRL_RSCCTRLMSK_Msk & (_UINT32_(value) << ETH_RSCCTRL_RSCCTRLMSK_Pos)) /* Assigment of value for RSCCTRLMSK in the ETH_RSCCTRL register */
#define ETH_RSCCTRL_Msk                       _UINT32_(0x0001FFFE)                                 /* (ETH_RSCCTRL) Register Mask  */


/* -------- ETH_INTMOD : (ETH Offset: 0x105C) (R/W 32) Interrupt Moderation -------- */
#define ETH_INTMOD_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_INTMOD) Interrupt Moderation  Reset Value */

#define ETH_INTMOD_RXINTMOD_Pos               _UINT32_(0)                                          /* (ETH_INTMOD) RX Interrupt Moderation Position */
#define ETH_INTMOD_RXINTMOD_Msk               (_UINT32_(0xFF) << ETH_INTMOD_RXINTMOD_Pos)          /* (ETH_INTMOD) RX Interrupt Moderation Mask */
#define ETH_INTMOD_RXINTMOD(value)            (ETH_INTMOD_RXINTMOD_Msk & (_UINT32_(value) << ETH_INTMOD_RXINTMOD_Pos)) /* Assigment of value for RXINTMOD in the ETH_INTMOD register */
#define ETH_INTMOD_TXINTMOD_Pos               _UINT32_(16)                                         /* (ETH_INTMOD) TX Interrupt Moderation Position */
#define ETH_INTMOD_TXINTMOD_Msk               (_UINT32_(0xFF) << ETH_INTMOD_TXINTMOD_Pos)          /* (ETH_INTMOD) TX Interrupt Moderation Mask */
#define ETH_INTMOD_TXINTMOD(value)            (ETH_INTMOD_TXINTMOD_Msk & (_UINT32_(value) << ETH_INTMOD_TXINTMOD_Pos)) /* Assigment of value for TXINTMOD in the ETH_INTMOD register */
#define ETH_INTMOD_Msk                        _UINT32_(0x00FF00FF)                                 /* (ETH_INTMOD) Register Mask  */


/* -------- ETH_SYSWT : (ETH Offset: 0x1060) (R/W 32) Sys Wake Time -------- */
#define ETH_SYSWT_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_SYSWT) Sys Wake Time  Reset Value */

#define ETH_SYSWT_SYSWT_Pos                   _UINT32_(0)                                          /* (ETH_SYSWT) Sys Wake Time Position */
#define ETH_SYSWT_SYSWT_Msk                   (_UINT32_(0xFFFF) << ETH_SYSWT_SYSWT_Pos)            /* (ETH_SYSWT) Sys Wake Time Mask */
#define ETH_SYSWT_SYSWT(value)                (ETH_SYSWT_SYSWT_Msk & (_UINT32_(value) << ETH_SYSWT_SYSWT_Pos)) /* Assigment of value for SYSWT in the ETH_SYSWT register */
#define ETH_SYSWT_Msk                         _UINT32_(0x0000FFFF)                                 /* (ETH_SYSWT) Register Mask  */


/* -------- ETH_HRB : (ETH Offset: 0x1080) (R/W 32) Hash Register Bottom [31:0] -------- */
#define ETH_HRB_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_HRB) Hash Register Bottom [31:0]  Reset Value */

#define ETH_HRB_ADDR_Pos                      _UINT32_(0)                                          /* (ETH_HRB) Hash Address Position */
#define ETH_HRB_ADDR_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_HRB_ADDR_Pos)           /* (ETH_HRB) Hash Address Mask */
#define ETH_HRB_ADDR(value)                   (ETH_HRB_ADDR_Msk & (_UINT32_(value) << ETH_HRB_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_HRB register */
#define ETH_HRB_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_HRB) Register Mask  */


/* -------- ETH_HRT : (ETH Offset: 0x1084) (R/W 32) Hash Register Top [63:32] -------- */
#define ETH_HRT_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_HRT) Hash Register Top [63:32]  Reset Value */

#define ETH_HRT_ADDR_Pos                      _UINT32_(0)                                          /* (ETH_HRT) Hash Address Position */
#define ETH_HRT_ADDR_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_HRT_ADDR_Pos)           /* (ETH_HRT) Hash Address Mask */
#define ETH_HRT_ADDR(value)                   (ETH_HRT_ADDR_Msk & (_UINT32_(value) << ETH_HRT_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_HRT register */
#define ETH_HRT_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_HRT) Register Mask  */


/* -------- ETH_STDM : (ETH Offset: 0x10A8) (R/W 32) Special Type ID Match N Register -------- */
#define ETH_STDM_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_STDM) Special Type ID Match N Register  Reset Value */

#define ETH_STDM_STDM_Pos                     _UINT32_(0)                                          /* (ETH_STDM) Special Type ID Match N Position */
#define ETH_STDM_STDM_Msk                     (_UINT32_(0xFFFF) << ETH_STDM_STDM_Pos)              /* (ETH_STDM) Special Type ID Match N Mask */
#define ETH_STDM_STDM(value)                  (ETH_STDM_STDM_Msk & (_UINT32_(value) << ETH_STDM_STDM_Pos)) /* Assigment of value for STDM in the ETH_STDM register */
#define ETH_STDM_ENCPY_Pos                    _UINT32_(31)                                         /* (ETH_STDM) Enable copying of type ID match N matched frames Position */
#define ETH_STDM_ENCPY_Msk                    (_UINT32_(0x1) << ETH_STDM_ENCPY_Pos)                /* (ETH_STDM) Enable copying of type ID match N matched frames Mask */
#define ETH_STDM_ENCPY(value)                 (ETH_STDM_ENCPY_Msk & (_UINT32_(value) << ETH_STDM_ENCPY_Pos)) /* Assigment of value for ENCPY in the ETH_STDM register */
#define ETH_STDM_Msk                          _UINT32_(0x8000FFFF)                                 /* (ETH_STDM) Register Mask  */


