Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/eth.h
/* -------- ETH_CSE : (ETH Offset: 0x114C) (R/W 32) Carrier Sense Errors Register -------- */
#define ETH_CSE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_CSE) Carrier Sense Errors Register  Reset Value */

#define ETH_CSE_CSR_Pos                       _UINT32_(0)                                          /* (ETH_CSE) Carrier Sense Error Position */
#define ETH_CSE_CSR_Msk                       (_UINT32_(0x3FF) << ETH_CSE_CSR_Pos)                 /* (ETH_CSE) Carrier Sense Error Mask */
#define ETH_CSE_CSR(value)                    (ETH_CSE_CSR_Msk & (_UINT32_(value) << ETH_CSE_CSR_Pos)) /* Assigment of value for CSR in the ETH_CSE register */
#define ETH_CSE_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_CSE) Register Mask  */


/* -------- ETH_ORLO : (ETH Offset: 0x1150) (R/W 32) Octets Received [31:0] Received -------- */
#define ETH_ORLO_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_ORLO) Octets Received [31:0] Received  Reset Value */

#define ETH_ORLO_RXO_Pos                      _UINT32_(0)                                          /* (ETH_ORLO) Received Octets Position */
#define ETH_ORLO_RXO_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_ORLO_RXO_Pos)           /* (ETH_ORLO) Received Octets Mask */
#define ETH_ORLO_RXO(value)                   (ETH_ORLO_RXO_Msk & (_UINT32_(value) << ETH_ORLO_RXO_Pos)) /* Assigment of value for RXO in the ETH_ORLO register */
#define ETH_ORLO_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_ORLO) Register Mask  */


/* -------- ETH_ORHI : (ETH Offset: 0x1154) (R/W 32) Octets Received [47:32] Received -------- */
#define ETH_ORHI_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_ORHI) Octets Received [47:32] Received  Reset Value */

#define ETH_ORHI_RXO_Pos                      _UINT32_(0)                                          /* (ETH_ORHI) Received Octets Position */
#define ETH_ORHI_RXO_Msk                      (_UINT32_(0xFFFF) << ETH_ORHI_RXO_Pos)               /* (ETH_ORHI) Received Octets Mask */
#define ETH_ORHI_RXO(value)                   (ETH_ORHI_RXO_Msk & (_UINT32_(value) << ETH_ORHI_RXO_Pos)) /* Assigment of value for RXO in the ETH_ORHI register */
#define ETH_ORHI_Msk                          _UINT32_(0x0000FFFF)                                 /* (ETH_ORHI) Register Mask  */


/* -------- ETH_FR : (ETH Offset: 0x1158) (R/W 32) Frames Received Register -------- */
#define ETH_FR_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_FR) Frames Received Register  Reset Value */

#define ETH_FR_FRX_Pos                        _UINT32_(0)                                          /* (ETH_FR) Frames Received without Error Position */
#define ETH_FR_FRX_Msk                        (_UINT32_(0xFFFFFFFF) << ETH_FR_FRX_Pos)             /* (ETH_FR) Frames Received without Error Mask */
#define ETH_FR_FRX(value)                     (ETH_FR_FRX_Msk & (_UINT32_(value) << ETH_FR_FRX_Pos)) /* Assigment of value for FRX in the ETH_FR register */
#define ETH_FR_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (ETH_FR) Register Mask  */


/* -------- ETH_BCFR : (ETH Offset: 0x115C) (R/W 32) Broadcast Frames Received Register -------- */
#define ETH_BCFR_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_BCFR) Broadcast Frames Received Register  Reset Value */

#define ETH_BCFR_BFRX_Pos                     _UINT32_(0)                                          /* (ETH_BCFR) Broadcast Frames Received without Error Position */
#define ETH_BCFR_BFRX_Msk                     (_UINT32_(0xFFFFFFFF) << ETH_BCFR_BFRX_Pos)          /* (ETH_BCFR) Broadcast Frames Received without Error Mask */
#define ETH_BCFR_BFRX(value)                  (ETH_BCFR_BFRX_Msk & (_UINT32_(value) << ETH_BCFR_BFRX_Pos)) /* Assigment of value for BFRX in the ETH_BCFR register */
#define ETH_BCFR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_BCFR) Register Mask  */


/* -------- ETH_MFR : (ETH Offset: 0x1160) (R/W 32) Multicast Frames Received Register -------- */
#define ETH_MFR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_MFR) Multicast Frames Received Register  Reset Value */

#define ETH_MFR_MFRX_Pos                      _UINT32_(0)                                          /* (ETH_MFR) Multicast Frames Received without Error Position */
#define ETH_MFR_MFRX_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_MFR_MFRX_Pos)           /* (ETH_MFR) Multicast Frames Received without Error Mask */
#define ETH_MFR_MFRX(value)                   (ETH_MFR_MFRX_Msk & (_UINT32_(value) << ETH_MFR_MFRX_Pos)) /* Assigment of value for MFRX in the ETH_MFR register */
#define ETH_MFR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_MFR) Register Mask  */


/* -------- ETH_PFR : (ETH Offset: 0x1164) (R/W 32) Pause Frames Received Register -------- */
#define ETH_PFR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_PFR) Pause Frames Received Register  Reset Value */

#define ETH_PFR_PFRX_Pos                      _UINT32_(0)                                          /* (ETH_PFR) Pause Frames Received Register Position */
#define ETH_PFR_PFRX_Msk                      (_UINT32_(0xFFFF) << ETH_PFR_PFRX_Pos)               /* (ETH_PFR) Pause Frames Received Register Mask */
#define ETH_PFR_PFRX(value)                   (ETH_PFR_PFRX_Msk & (_UINT32_(value) << ETH_PFR_PFRX_Pos)) /* Assigment of value for PFRX in the ETH_PFR register */
#define ETH_PFR_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_PFR) Register Mask  */


/* -------- ETH_BFR64 : (ETH Offset: 0x1168) (R/W 32) 64 Byte Frames Received Register -------- */
#define ETH_BFR64_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_BFR64) 64 Byte Frames Received Register  Reset Value */

#define ETH_BFR64_NFRX_Pos                    _UINT32_(0)                                          /* (ETH_BFR64) 64 Byte Frames Received without Error Position */
#define ETH_BFR64_NFRX_Msk                    (_UINT32_(0xFFFFFFFF) << ETH_BFR64_NFRX_Pos)         /* (ETH_BFR64) 64 Byte Frames Received without Error Mask */
#define ETH_BFR64_NFRX(value)                 (ETH_BFR64_NFRX_Msk & (_UINT32_(value) << ETH_BFR64_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_BFR64 register */
#define ETH_BFR64_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_BFR64) Register Mask  */


/* -------- ETH_TBFR127 : (ETH Offset: 0x116C) (R/W 32) 65 to 127 Byte Frames Received Register -------- */
#define ETH_TBFR127_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFR127) 65 to 127 Byte Frames Received Register  Reset Value */

#define ETH_TBFR127_NFRX_Pos                  _UINT32_(0)                                          /* (ETH_TBFR127) 65 to 127 Byte Frames Received without Error Position */
#define ETH_TBFR127_NFRX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFR127_NFRX_Pos)       /* (ETH_TBFR127) 65 to 127 Byte Frames Received without Error Mask */
#define ETH_TBFR127_NFRX(value)               (ETH_TBFR127_NFRX_Msk & (_UINT32_(value) << ETH_TBFR127_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR127 register */
#define ETH_TBFR127_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR127) Register Mask  */


/* -------- ETH_TBFR255 : (ETH Offset: 0x1170) (R/W 32) 128 to 255 Byte Frames Received Register -------- */
#define ETH_TBFR255_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFR255) 128 to 255 Byte Frames Received Register  Reset Value */

#define ETH_TBFR255_NFRX_Pos                  _UINT32_(0)                                          /* (ETH_TBFR255) 128 to 255 Byte Frames Received without Error Position */
#define ETH_TBFR255_NFRX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFR255_NFRX_Pos)       /* (ETH_TBFR255) 128 to 255 Byte Frames Received without Error Mask */
#define ETH_TBFR255_NFRX(value)               (ETH_TBFR255_NFRX_Msk & (_UINT32_(value) << ETH_TBFR255_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR255 register */
#define ETH_TBFR255_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR255) Register Mask  */


