Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/eth.h
#define ETH_RXQPTR_DMARXQPTR_Pos              _UINT32_(2)                                          /* (ETH_RXQPTR) Receive buffer queue base address Position */
#define ETH_RXQPTR_DMARXQPTR_Msk              (_UINT32_(0x3FFFFFFF) << ETH_RXQPTR_DMARXQPTR_Pos)   /* (ETH_RXQPTR) Receive buffer queue base address Mask */
#define ETH_RXQPTR_DMARXQPTR(value)           (ETH_RXQPTR_DMARXQPTR_Msk & (_UINT32_(value) << ETH_RXQPTR_DMARXQPTR_Pos)) /* Assigment of value for DMARXQPTR in the ETH_RXQPTR register */
#define ETH_RXQPTR_Msk                        _UINT32_(0xFFFFFFFC)                                 /* (ETH_RXQPTR) Register Mask  */


/* -------- ETH_DMARXQS : (ETH Offset: 0x15E0) (R/W 32) Receive Buffer Queue Size -------- */
#define ETH_DMARXQS_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_DMARXQS) Receive Buffer Queue Size  Reset Value */

#define ETH_DMARXQS_DMARXQS_Pos               _UINT32_(0)                                          /* (ETH_DMARXQS) Receive Buffer Queue Size Position */
#define ETH_DMARXQS_DMARXQS_Msk               (_UINT32_(0xFF) << ETH_DMARXQS_DMARXQS_Pos)          /* (ETH_DMARXQS) Receive Buffer Queue Size Mask */
#define ETH_DMARXQS_DMARXQS(value)            (ETH_DMARXQS_DMARXQS_Msk & (_UINT32_(value) << ETH_DMARXQS_DMARXQS_Pos)) /* Assigment of value for DMARXQS in the ETH_DMARXQS register */
#define ETH_DMARXQS_Msk                       _UINT32_(0x000000FF)                                 /* (ETH_DMARXQS) Register Mask  */


/* -------- ETH_IERQ : (ETH Offset: 0x1600) (R/W 32) Interrupt Enable Queue N -------- */
#define ETH_IERQ_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_IERQ) Interrupt Enable Queue N  Reset Value */

#define ETH_IERQ_RCOMP_Pos                    _UINT32_(1)                                          /* (ETH_IERQ) Receive Complete Position */
#define ETH_IERQ_RCOMP_Msk                    (_UINT32_(0x1) << ETH_IERQ_RCOMP_Pos)                /* (ETH_IERQ) Receive Complete Mask */
#define ETH_IERQ_RCOMP(value)                 (ETH_IERQ_RCOMP_Msk & (_UINT32_(value) << ETH_IERQ_RCOMP_Pos)) /* Assigment of value for RCOMP in the ETH_IERQ register */
#define ETH_IERQ_RXUBR_Pos                    _UINT32_(2)                                          /* (ETH_IERQ) RX Used Bit Read Position */
#define ETH_IERQ_RXUBR_Msk                    (_UINT32_(0x1) << ETH_IERQ_RXUBR_Pos)                /* (ETH_IERQ) RX Used Bit Read Mask */
#define ETH_IERQ_RXUBR(value)                 (ETH_IERQ_RXUBR_Msk & (_UINT32_(value) << ETH_IERQ_RXUBR_Pos)) /* Assigment of value for RXUBR in the ETH_IERQ register */
#define ETH_IERQ_TXUBR_Pos                    _UINT32_(3)                                          /* (ETH_IERQ) TX Used Bit Read Position */
#define ETH_IERQ_TXUBR_Msk                    (_UINT32_(0x1) << ETH_IERQ_TXUBR_Pos)                /* (ETH_IERQ) TX Used Bit Read Mask */
#define ETH_IERQ_TXUBR(value)                 (ETH_IERQ_TXUBR_Msk & (_UINT32_(value) << ETH_IERQ_TXUBR_Pos)) /* Assigment of value for TXUBR in the ETH_IERQ register */
#define ETH_IERQ_TUR_Pos                      _UINT32_(4)                                          /* (ETH_IERQ) Transmit Underrun Position */
#define ETH_IERQ_TUR_Msk                      (_UINT32_(0x1) << ETH_IERQ_TUR_Pos)                  /* (ETH_IERQ) Transmit Underrun Mask */
#define ETH_IERQ_TUR(value)                   (ETH_IERQ_TUR_Msk & (_UINT32_(value) << ETH_IERQ_TUR_Pos)) /* Assigment of value for TUR in the ETH_IERQ register */
#define ETH_IERQ_RLEX_Pos                     _UINT32_(5)                                          /* (ETH_IERQ) Retry Limit Exceeded Position */
#define ETH_IERQ_RLEX_Msk                     (_UINT32_(0x1) << ETH_IERQ_RLEX_Pos)                 /* (ETH_IERQ) Retry Limit Exceeded Mask */
#define ETH_IERQ_RLEX(value)                  (ETH_IERQ_RLEX_Msk & (_UINT32_(value) << ETH_IERQ_RLEX_Pos)) /* Assigment of value for RLEX in the ETH_IERQ register */
#define ETH_IERQ_TFC_Pos                      _UINT32_(6)                                          /* (ETH_IERQ) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_IERQ_TFC_Msk                      (_UINT32_(0x1) << ETH_IERQ_TFC_Pos)                  /* (ETH_IERQ) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_IERQ_TFC(value)                   (ETH_IERQ_TFC_Msk & (_UINT32_(value) << ETH_IERQ_TFC_Pos)) /* Assigment of value for TFC in the ETH_IERQ register */
#define ETH_IERQ_TCOMP_Pos                    _UINT32_(7)                                          /* (ETH_IERQ) Transmit Complete Position */
#define ETH_IERQ_TCOMP_Msk                    (_UINT32_(0x1) << ETH_IERQ_TCOMP_Pos)                /* (ETH_IERQ) Transmit Complete Mask */
#define ETH_IERQ_TCOMP(value)                 (ETH_IERQ_TCOMP_Msk & (_UINT32_(value) << ETH_IERQ_TCOMP_Pos)) /* Assigment of value for TCOMP in the ETH_IERQ register */
#define ETH_IERQ_ROVR_Pos                     _UINT32_(10)                                         /* (ETH_IERQ) Receive Overrun Position */
#define ETH_IERQ_ROVR_Msk                     (_UINT32_(0x1) << ETH_IERQ_ROVR_Pos)                 /* (ETH_IERQ) Receive Overrun Mask */
#define ETH_IERQ_ROVR(value)                  (ETH_IERQ_ROVR_Msk & (_UINT32_(value) << ETH_IERQ_ROVR_Pos)) /* Assigment of value for ROVR in the ETH_IERQ register */
#define ETH_IERQ_HRESP_Pos                    _UINT32_(11)                                         /* (ETH_IERQ) HRESP Not OK Position */
#define ETH_IERQ_HRESP_Msk                    (_UINT32_(0x1) << ETH_IERQ_HRESP_Pos)                /* (ETH_IERQ) HRESP Not OK Mask */
#define ETH_IERQ_HRESP(value)                 (ETH_IERQ_HRESP_Msk & (_UINT32_(value) << ETH_IERQ_HRESP_Pos)) /* Assigment of value for HRESP in the ETH_IERQ register */
#define ETH_IERQ_Msk                          _UINT32_(0x00000CFE)                                 /* (ETH_IERQ) Register Mask  */


/* -------- ETH_IDRQ : (ETH Offset: 0x1620) (R/W 32) Interrupt Disable Queue N -------- */
#define ETH_IDRQ_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_IDRQ) Interrupt Disable Queue N  Reset Value */

