Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/eth.h
#define ETH_IDRQ_RCOMP_Pos                    _UINT32_(1)                                          /* (ETH_IDRQ) Receive Complete Position */
#define ETH_IDRQ_RCOMP_Msk                    (_UINT32_(0x1) << ETH_IDRQ_RCOMP_Pos)                /* (ETH_IDRQ) Receive Complete Mask */
#define ETH_IDRQ_RCOMP(value)                 (ETH_IDRQ_RCOMP_Msk & (_UINT32_(value) << ETH_IDRQ_RCOMP_Pos)) /* Assigment of value for RCOMP in the ETH_IDRQ register */
#define ETH_IDRQ_RXUBR_Pos                    _UINT32_(2)                                          /* (ETH_IDRQ) RX Used Bit Read Position */
#define ETH_IDRQ_RXUBR_Msk                    (_UINT32_(0x1) << ETH_IDRQ_RXUBR_Pos)                /* (ETH_IDRQ) RX Used Bit Read Mask */
#define ETH_IDRQ_RXUBR(value)                 (ETH_IDRQ_RXUBR_Msk & (_UINT32_(value) << ETH_IDRQ_RXUBR_Pos)) /* Assigment of value for RXUBR in the ETH_IDRQ register */
#define ETH_IDRQ_TXUBR_Pos                    _UINT32_(3)                                          /* (ETH_IDRQ) TX Used Bit Read Position */
#define ETH_IDRQ_TXUBR_Msk                    (_UINT32_(0x1) << ETH_IDRQ_TXUBR_Pos)                /* (ETH_IDRQ) TX Used Bit Read Mask */
#define ETH_IDRQ_TXUBR(value)                 (ETH_IDRQ_TXUBR_Msk & (_UINT32_(value) << ETH_IDRQ_TXUBR_Pos)) /* Assigment of value for TXUBR in the ETH_IDRQ register */
#define ETH_IDRQ_TUR_Pos                      _UINT32_(4)                                          /* (ETH_IDRQ) Transmit Underrun Position */
#define ETH_IDRQ_TUR_Msk                      (_UINT32_(0x1) << ETH_IDRQ_TUR_Pos)                  /* (ETH_IDRQ) Transmit Underrun Mask */
#define ETH_IDRQ_TUR(value)                   (ETH_IDRQ_TUR_Msk & (_UINT32_(value) << ETH_IDRQ_TUR_Pos)) /* Assigment of value for TUR in the ETH_IDRQ register */
#define ETH_IDRQ_RLEX_Pos                     _UINT32_(5)                                          /* (ETH_IDRQ) Retry Limit Exceeded Position */
#define ETH_IDRQ_RLEX_Msk                     (_UINT32_(0x1) << ETH_IDRQ_RLEX_Pos)                 /* (ETH_IDRQ) Retry Limit Exceeded Mask */
#define ETH_IDRQ_RLEX(value)                  (ETH_IDRQ_RLEX_Msk & (_UINT32_(value) << ETH_IDRQ_RLEX_Pos)) /* Assigment of value for RLEX in the ETH_IDRQ register */
#define ETH_IDRQ_TFC_Pos                      _UINT32_(6)                                          /* (ETH_IDRQ) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_IDRQ_TFC_Msk                      (_UINT32_(0x1) << ETH_IDRQ_TFC_Pos)                  /* (ETH_IDRQ) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_IDRQ_TFC(value)                   (ETH_IDRQ_TFC_Msk & (_UINT32_(value) << ETH_IDRQ_TFC_Pos)) /* Assigment of value for TFC in the ETH_IDRQ register */
#define ETH_IDRQ_TCOMP_Pos                    _UINT32_(7)                                          /* (ETH_IDRQ) Transmit Complete Position */
#define ETH_IDRQ_TCOMP_Msk                    (_UINT32_(0x1) << ETH_IDRQ_TCOMP_Pos)                /* (ETH_IDRQ) Transmit Complete Mask */
#define ETH_IDRQ_TCOMP(value)                 (ETH_IDRQ_TCOMP_Msk & (_UINT32_(value) << ETH_IDRQ_TCOMP_Pos)) /* Assigment of value for TCOMP in the ETH_IDRQ register */
#define ETH_IDRQ_ROVR_Pos                     _UINT32_(10)                                         /* (ETH_IDRQ) Receive Overrun Position */
#define ETH_IDRQ_ROVR_Msk                     (_UINT32_(0x1) << ETH_IDRQ_ROVR_Pos)                 /* (ETH_IDRQ) Receive Overrun Mask */
#define ETH_IDRQ_ROVR(value)                  (ETH_IDRQ_ROVR_Msk & (_UINT32_(value) << ETH_IDRQ_ROVR_Pos)) /* Assigment of value for ROVR in the ETH_IDRQ register */
#define ETH_IDRQ_HRESP_Pos                    _UINT32_(11)                                         /* (ETH_IDRQ) HRESP Not OK Position */
#define ETH_IDRQ_HRESP_Msk                    (_UINT32_(0x1) << ETH_IDRQ_HRESP_Pos)                /* (ETH_IDRQ) HRESP Not OK Mask */
#define ETH_IDRQ_HRESP(value)                 (ETH_IDRQ_HRESP_Msk & (_UINT32_(value) << ETH_IDRQ_HRESP_Pos)) /* Assigment of value for HRESP in the ETH_IDRQ register */
#define ETH_IDRQ_Msk                          _UINT32_(0x00000CFE)                                 /* (ETH_IDRQ) Register Mask  */


/* -------- ETH_IMRQ : (ETH Offset: 0x1640) (R/W 32) Interrupt Mask  Queue Register -------- */
#define ETH_IMRQ_RESETVALUE                   _UINT32_(0x876)                                      /*  (ETH_IMRQ) Interrupt Mask  Queue Register  Reset Value */

#define ETH_IMRQ_RCOMP_Pos                    _UINT32_(1)                                          /* (ETH_IMRQ) Receive Complete Position */
#define ETH_IMRQ_RCOMP_Msk                    (_UINT32_(0x1) << ETH_IMRQ_RCOMP_Pos)                /* (ETH_IMRQ) Receive Complete Mask */
#define ETH_IMRQ_RCOMP(value)                 (ETH_IMRQ_RCOMP_Msk & (_UINT32_(value) << ETH_IMRQ_RCOMP_Pos)) /* Assigment of value for RCOMP in the ETH_IMRQ register */
#define ETH_IMRQ_RXUBR_Pos                    _UINT32_(2)                                          /* (ETH_IMRQ) RX Used Bit Read Position */
#define ETH_IMRQ_RXUBR_Msk                    (_UINT32_(0x1) << ETH_IMRQ_RXUBR_Pos)                /* (ETH_IMRQ) RX Used Bit Read Mask */
#define ETH_IMRQ_RXUBR(value)                 (ETH_IMRQ_RXUBR_Msk & (_UINT32_(value) << ETH_IMRQ_RXUBR_Pos)) /* Assigment of value for RXUBR in the ETH_IMRQ register */
#define ETH_IMRQ_TXUBR_Pos                    _UINT32_(3)                                          /* (ETH_IMRQ) TX Used Bit Read Position */
#define ETH_IMRQ_TXUBR_Msk                    (_UINT32_(0x1) << ETH_IMRQ_TXUBR_Pos)                /* (ETH_IMRQ) TX Used Bit Read Mask */
#define ETH_IMRQ_TXUBR(value)                 (ETH_IMRQ_TXUBR_Msk & (_UINT32_(value) << ETH_IMRQ_TXUBR_Pos)) /* Assigment of value for TXUBR in the ETH_IMRQ register */
#define ETH_IMRQ_TUR_Pos                      _UINT32_(4)                                          /* (ETH_IMRQ) Transmit Underrun Position */
#define ETH_IMRQ_TUR_Msk                      (_UINT32_(0x1) << ETH_IMRQ_TUR_Pos)                  /* (ETH_IMRQ) Transmit Underrun Mask */
#define ETH_IMRQ_TUR(value)                   (ETH_IMRQ_TUR_Msk & (_UINT32_(value) << ETH_IMRQ_TUR_Pos)) /* Assigment of value for TUR in the ETH_IMRQ register */
#define ETH_IMRQ_RLEX_Pos                     _UINT32_(5)                                          /* (ETH_IMRQ) Retry Limit Exceeded Position */
#define ETH_IMRQ_RLEX_Msk                     (_UINT32_(0x1) << ETH_IMRQ_RLEX_Pos)                 /* (ETH_IMRQ) Retry Limit Exceeded Mask */
#define ETH_IMRQ_RLEX(value)                  (ETH_IMRQ_RLEX_Msk & (_UINT32_(value) << ETH_IMRQ_RLEX_Pos)) /* Assigment of value for RLEX in the ETH_IMRQ register */
#define ETH_IMRQ_TFC_Pos                      _UINT32_(6)                                          /* (ETH_IMRQ) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_IMRQ_TFC_Msk                      (_UINT32_(0x1) << ETH_IMRQ_TFC_Pos)                  /* (ETH_IMRQ) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_IMRQ_TFC(value)                   (ETH_IMRQ_TFC_Msk & (_UINT32_(value) << ETH_IMRQ_TFC_Pos)) /* Assigment of value for TFC in the ETH_IMRQ register */
#define ETH_IMRQ_TCOMP_Pos                    _UINT32_(7)                                          /* (ETH_IMRQ) Transmit Complete Position */
#define ETH_IMRQ_TCOMP_Msk                    (_UINT32_(0x1) << ETH_IMRQ_TCOMP_Pos)                /* (ETH_IMRQ) Transmit Complete Mask */
#define ETH_IMRQ_TCOMP(value)                 (ETH_IMRQ_TCOMP_Msk & (_UINT32_(value) << ETH_IMRQ_TCOMP_Pos)) /* Assigment of value for TCOMP in the ETH_IMRQ register */
#define ETH_IMRQ_ROVR_Pos                     _UINT32_(10)                                         /* (ETH_IMRQ) Receive Overrun Position */
#define ETH_IMRQ_ROVR_Msk                     (_UINT32_(0x1) << ETH_IMRQ_ROVR_Pos)                 /* (ETH_IMRQ) Receive Overrun Mask */
#define ETH_IMRQ_ROVR(value)                  (ETH_IMRQ_ROVR_Msk & (_UINT32_(value) << ETH_IMRQ_ROVR_Pos)) /* Assigment of value for ROVR in the ETH_IMRQ register */
#define ETH_IMRQ_HRESP_Pos                    _UINT32_(11)                                         /* (ETH_IMRQ) HRESP Not OK Position */
#define ETH_IMRQ_HRESP_Msk                    (_UINT32_(0x1) << ETH_IMRQ_HRESP_Pos)                /* (ETH_IMRQ) HRESP Not OK Mask */
#define ETH_IMRQ_HRESP(value)                 (ETH_IMRQ_HRESP_Msk & (_UINT32_(value) << ETH_IMRQ_HRESP_Pos)) /* Assigment of value for HRESP in the ETH_IMRQ register */
#define ETH_IMRQ_Msk                          _UINT32_(0x00000CFE)                                 /* (ETH_IMRQ) Register Mask  */


