Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/eth.h
#define ETH_SCRT1_6_REG_OFST           _UINT32_(0x1518)    /* (ETH_SCRT1_6) Screening Type 1 Register N Offset */
#define ETH_SCRT1_7_REG_OFST           _UINT32_(0x151C)    /* (ETH_SCRT1_7) Screening Type 1 Register N Offset */
#define ETH_SCRT1_8_REG_OFST           _UINT32_(0x1520)    /* (ETH_SCRT1_8) Screening Type 1 Register N Offset */
#define ETH_SCRT1_9_REG_OFST           _UINT32_(0x1524)    /* (ETH_SCRT1_9) Screening Type 1 Register N Offset */
#define ETH_SCRT1_10_REG_OFST          _UINT32_(0x1528)    /* (ETH_SCRT1_10) Screening Type 1 Register N Offset */
#define ETH_SCRT1_11_REG_OFST          _UINT32_(0x152C)    /* (ETH_SCRT1_11) Screening Type 1 Register N Offset */
#define ETH_SCRT1_12_REG_OFST          _UINT32_(0x1530)    /* (ETH_SCRT1_12) Screening Type 1 Register N Offset */
#define ETH_SCRT1_13_REG_OFST          _UINT32_(0x1534)    /* (ETH_SCRT1_13) Screening Type 1 Register N Offset */
#define ETH_SCRT1_14_REG_OFST          _UINT32_(0x1538)    /* (ETH_SCRT1_14) Screening Type 1 Register N Offset */
#define ETH_SCRT1_15_REG_OFST          _UINT32_(0x153C)    /* (ETH_SCRT1_15) Screening Type 1 Register N Offset */
#define ETH_SCRT2_REG_OFST             _UINT32_(0x1540)    /* (ETH_SCRT2) Screening Type 2 Register Offset */
#define ETH_SCRT2_0_REG_OFST           _UINT32_(0x1540)    /* (ETH_SCRT2_0) Screening Type 2 Register Offset */
#define ETH_SCRT2_1_REG_OFST           _UINT32_(0x1544)    /* (ETH_SCRT2_1) Screening Type 2 Register Offset */
#define ETH_SCRT2_2_REG_OFST           _UINT32_(0x1548)    /* (ETH_SCRT2_2) Screening Type 2 Register Offset */
#define ETH_SCRT2_3_REG_OFST           _UINT32_(0x154C)    /* (ETH_SCRT2_3) Screening Type 2 Register Offset */
#define ETH_SCRT2_4_REG_OFST           _UINT32_(0x1550)    /* (ETH_SCRT2_4) Screening Type 2 Register Offset */
#define ETH_SCRT2_5_REG_OFST           _UINT32_(0x1554)    /* (ETH_SCRT2_5) Screening Type 2 Register Offset */
#define ETH_SCRT2_6_REG_OFST           _UINT32_(0x1558)    /* (ETH_SCRT2_6) Screening Type 2 Register Offset */
#define ETH_SCRT2_7_REG_OFST           _UINT32_(0x155C)    /* (ETH_SCRT2_7) Screening Type 2 Register Offset */
#define ETH_SCRT2_8_REG_OFST           _UINT32_(0x1560)    /* (ETH_SCRT2_8) Screening Type 2 Register Offset */
#define ETH_SCRT2_9_REG_OFST           _UINT32_(0x1564)    /* (ETH_SCRT2_9) Screening Type 2 Register Offset */
#define ETH_SCRT2_10_REG_OFST          _UINT32_(0x1568)    /* (ETH_SCRT2_10) Screening Type 2 Register Offset */
#define ETH_SCRT2_11_REG_OFST          _UINT32_(0x156C)    /* (ETH_SCRT2_11) Screening Type 2 Register Offset */
#define ETH_SCRT2_12_REG_OFST          _UINT32_(0x1570)    /* (ETH_SCRT2_12) Screening Type 2 Register Offset */
#define ETH_SCRT2_13_REG_OFST          _UINT32_(0x1574)    /* (ETH_SCRT2_13) Screening Type 2 Register Offset */
#define ETH_SCRT2_14_REG_OFST          _UINT32_(0x1578)    /* (ETH_SCRT2_14) Screening Type 2 Register Offset */
#define ETH_SCRT2_15_REG_OFST          _UINT32_(0x157C)    /* (ETH_SCRT2_15) Screening Type 2 Register Offset */
#define ETH_RXQPTR_REG_OFST            _UINT32_(0x15C0)    /* (ETH_RXQPTR) Receive buffer queue base address Offset */
#define ETH_RXQPTR0_REG_OFST           _UINT32_(0x15C0)    /* (ETH_RXQPTR0) Receive buffer queue base address Offset */
#define ETH_RXQPTR1_REG_OFST           _UINT32_(0x15C4)    /* (ETH_RXQPTR1) Receive buffer queue base address Offset */
#define ETH_RXQPTR2_REG_OFST           _UINT32_(0x15C8)    /* (ETH_RXQPTR2) Receive buffer queue base address Offset */
#define ETH_RXQPTR3_REG_OFST           _UINT32_(0x15CC)    /* (ETH_RXQPTR3) Receive buffer queue base address Offset */
#define ETH_RXQPTR4_REG_OFST           _UINT32_(0x15D0)    /* (ETH_RXQPTR4) Receive buffer queue base address Offset */
#define ETH_RXQPTR5_REG_OFST           _UINT32_(0x15D4)    /* (ETH_RXQPTR5) Receive buffer queue base address Offset */
#define ETH_RXQPTR6_REG_OFST           _UINT32_(0x15D8)    /* (ETH_RXQPTR6) Receive buffer queue base address Offset */
#define ETH_RXQPTR7_REG_OFST           _UINT32_(0x15DC)    /* (ETH_RXQPTR7) Receive buffer queue base address Offset */
#define ETH_DMARXQS_REG_OFST           _UINT32_(0x15E0)    /* (ETH_DMARXQS) Receive Buffer Queue Size Offset */
#define ETH_DMARXQS0_REG_OFST          _UINT32_(0x15E0)    /* (ETH_DMARXQS0) Receive Buffer Queue Size Offset */
#define ETH_DMARXQS1_REG_OFST          _UINT32_(0x15E4)    /* (ETH_DMARXQS1) Receive Buffer Queue Size Offset */
#define ETH_DMARXQS2_REG_OFST          _UINT32_(0x15E8)    /* (ETH_DMARXQS2) Receive Buffer Queue Size Offset */
#define ETH_DMARXQS3_REG_OFST          _UINT32_(0x15EC)    /* (ETH_DMARXQS3) Receive Buffer Queue Size Offset */
#define ETH_DMARXQS4_REG_OFST          _UINT32_(0x15F0)    /* (ETH_DMARXQS4) Receive Buffer Queue Size Offset */
#define ETH_DMARXQS5_REG_OFST          _UINT32_(0x15F4)    /* (ETH_DMARXQS5) Receive Buffer Queue Size Offset */
#define ETH_DMARXQS6_REG_OFST          _UINT32_(0x15F8)    /* (ETH_DMARXQS6) Receive Buffer Queue Size Offset */
#define ETH_DMARXQS7_REG_OFST          _UINT32_(0x15FC)    /* (ETH_DMARXQS7) Receive Buffer Queue Size Offset */
#define ETH_IERQ_REG_OFST              _UINT32_(0x1600)    /* (ETH_IERQ) Interrupt Enable Queue N Offset */
#define ETH_IERQ0_REG_OFST             _UINT32_(0x1600)    /* (ETH_IERQ0) Interrupt Enable Queue N Offset */
#define ETH_IERQ1_REG_OFST             _UINT32_(0x1604)    /* (ETH_IERQ1) Interrupt Enable Queue N Offset */
#define ETH_IERQ2_REG_OFST             _UINT32_(0x1608)    /* (ETH_IERQ2) Interrupt Enable Queue N Offset */
#define ETH_IERQ3_REG_OFST             _UINT32_(0x160C)    /* (ETH_IERQ3) Interrupt Enable Queue N Offset */
#define ETH_IERQ4_REG_OFST             _UINT32_(0x1610)    /* (ETH_IERQ4) Interrupt Enable Queue N Offset */
#define ETH_IERQ5_REG_OFST             _UINT32_(0x1614)    /* (ETH_IERQ5) Interrupt Enable Queue N Offset */
#define ETH_IERQ6_REG_OFST             _UINT32_(0x1618)    /* (ETH_IERQ6) Interrupt Enable Queue N Offset */
#define ETH_IDRQ_REG_OFST              _UINT32_(0x1620)    /* (ETH_IDRQ) Interrupt Disable Queue N Offset */
#define ETH_IDRQ0_REG_OFST             _UINT32_(0x1620)    /* (ETH_IDRQ0) Interrupt Disable Queue N Offset */
#define ETH_IDRQ1_REG_OFST             _UINT32_(0x1624)    /* (ETH_IDRQ1) Interrupt Disable Queue N Offset */
#define ETH_IDRQ2_REG_OFST             _UINT32_(0x1628)    /* (ETH_IDRQ2) Interrupt Disable Queue N Offset */
#define ETH_IDRQ3_REG_OFST             _UINT32_(0x162C)    /* (ETH_IDRQ3) Interrupt Disable Queue N Offset */
#define ETH_IDRQ4_REG_OFST             _UINT32_(0x1630)    /* (ETH_IDRQ4) Interrupt Disable Queue N Offset */
#define ETH_IDRQ5_REG_OFST             _UINT32_(0x1634)    /* (ETH_IDRQ5) Interrupt Disable Queue N Offset */
#define ETH_IDRQ6_REG_OFST             _UINT32_(0x1638)    /* (ETH_IDRQ6) Interrupt Disable Queue N Offset */
#define ETH_IMRQ_REG_OFST              _UINT32_(0x1640)    /* (ETH_IMRQ) Interrupt Mask  Queue Register Offset */
#define ETH_IMRQ0_REG_OFST             _UINT32_(0x1640)    /* (ETH_IMRQ0) Interrupt Mask  Queue Register Offset */
#define ETH_IMRQ1_REG_OFST             _UINT32_(0x1644)    /* (ETH_IMRQ1) Interrupt Mask  Queue Register Offset */
#define ETH_IMRQ2_REG_OFST             _UINT32_(0x1648)    /* (ETH_IMRQ2) Interrupt Mask  Queue Register Offset */
#define ETH_IMRQ3_REG_OFST             _UINT32_(0x164C)    /* (ETH_IMRQ3) Interrupt Mask  Queue Register Offset */
#define ETH_IMRQ4_REG_OFST             _UINT32_(0x1650)    /* (ETH_IMRQ4) Interrupt Mask  Queue Register Offset */
#define ETH_IMRQ5_REG_OFST             _UINT32_(0x1654)    /* (ETH_IMRQ5) Interrupt Mask  Queue Register Offset */
#define ETH_IMRQ6_REG_OFST             _UINT32_(0x1658)    /* (ETH_IMRQ6) Interrupt Mask  Queue Register Offset */
#define ETH_IERQU_REG_OFST             _UINT32_(0x1660)    /* (ETH_IERQU) Interrupt Enable Queue N (upper) Offset */
#define ETH_IERQU0_REG_OFST            _UINT32_(0x1660)    /* (ETH_IERQU0) Interrupt Enable Queue N (upper) Offset */
#define ETH_IERQU1_REG_OFST            _UINT32_(0x1664)    /* (ETH_IERQU1) Interrupt Enable Queue N (upper) Offset */
#define ETH_IERQU2_REG_OFST            _UINT32_(0x1668)    /* (ETH_IERQU2) Interrupt Enable Queue N (upper) Offset */
#define ETH_IERQU3_REG_OFST            _UINT32_(0x166C)    /* (ETH_IERQU3) Interrupt Enable Queue N (upper) Offset */
#define ETH_IERQU4_REG_OFST            _UINT32_(0x1670)    /* (ETH_IERQU4) Interrupt Enable Queue N (upper) Offset */
#define ETH_IERQU5_REG_OFST            _UINT32_(0x1674)    /* (ETH_IERQU5) Interrupt Enable Queue N (upper) Offset */
#define ETH_IERQU6_REG_OFST            _UINT32_(0x1678)    /* (ETH_IERQU6) Interrupt Enable Queue N (upper) Offset */
#define ETH_IERQU7_REG_OFST            _UINT32_(0x167C)    /* (ETH_IERQU7) Interrupt Enable Queue N (upper) Offset */
#define ETH_IDRQU_REG_OFST             _UINT32_(0x1680)    /* (ETH_IDRQU) Interrupt Disable Queue N (upper) Offset */
#define ETH_IDRQU0_REG_OFST            _UINT32_(0x1680)    /* (ETH_IDRQU0) Interrupt Disable Queue N (upper) Offset */
#define ETH_IDRQU1_REG_OFST            _UINT32_(0x1684)    /* (ETH_IDRQU1) Interrupt Disable Queue N (upper) Offset */
#define ETH_IDRQU2_REG_OFST            _UINT32_(0x1688)    /* (ETH_IDRQU2) Interrupt Disable Queue N (upper) Offset */
#define ETH_IDRQU3_REG_OFST            _UINT32_(0x168C)    /* (ETH_IDRQU3) Interrupt Disable Queue N (upper) Offset */
#define ETH_IDRQU4_REG_OFST            _UINT32_(0x1690)    /* (ETH_IDRQU4) Interrupt Disable Queue N (upper) Offset */
#define ETH_IDRQU5_REG_OFST            _UINT32_(0x1694)    /* (ETH_IDRQU5) Interrupt Disable Queue N (upper) Offset */
#define ETH_IDRQU6_REG_OFST            _UINT32_(0x1698)    /* (ETH_IDRQU6) Interrupt Disable Queue N (upper) Offset */
#define ETH_IDRQU7_REG_OFST            _UINT32_(0x169C)    /* (ETH_IDRQU7) Interrupt Disable Queue N (upper) Offset */
#define ETH_IMRQU_REG_OFST             _UINT32_(0x16A0)    /* (ETH_IMRQU) Interrupt Mask Queue N (upper) Offset */
#define ETH_IMRQU0_REG_OFST            _UINT32_(0x16A0)    /* (ETH_IMRQU0) Interrupt Mask Queue N (upper) Offset */
#define ETH_IMRQU1_REG_OFST            _UINT32_(0x16A4)    /* (ETH_IMRQU1) Interrupt Mask Queue N (upper) Offset */
#define ETH_IMRQU2_REG_OFST            _UINT32_(0x16A8)    /* (ETH_IMRQU2) Interrupt Mask Queue N (upper) Offset */
#define ETH_IMRQU3_REG_OFST            _UINT32_(0x16AC)    /* (ETH_IMRQU3) Interrupt Mask Queue N (upper) Offset */
#define ETH_IMRQU4_REG_OFST            _UINT32_(0x16B0)    /* (ETH_IMRQU4) Interrupt Mask Queue N (upper) Offset */
#define ETH_IMRQU5_REG_OFST            _UINT32_(0x16B4)    /* (ETH_IMRQU5) Interrupt Mask Queue N (upper) Offset */
#define ETH_IMRQU6_REG_OFST            _UINT32_(0x16B8)    /* (ETH_IMRQU6) Interrupt Mask Queue N (upper) Offset */
#define ETH_IMRQU7_REG_OFST            _UINT32_(0x16BC)    /* (ETH_IMRQU7) Interrupt Mask Queue N (upper) Offset */
#define ETH_SCRT2ET_REG_OFST           _UINT32_(0x16E0)    /* (ETH_SCRT2ET) Screening Type 2 EtherType Register Offset */
#define ETH_SCRT2ET0_REG_OFST          _UINT32_(0x16E0)    /* (ETH_SCRT2ET0) Screening Type 2 EtherType Register Offset */
#define ETH_SCRT2ET1_REG_OFST          _UINT32_(0x16E4)    /* (ETH_SCRT2ET1) Screening Type 2 EtherType Register Offset */
#define ETH_SCRT2ET2_REG_OFST          _UINT32_(0x16E8)    /* (ETH_SCRT2ET2) Screening Type 2 EtherType Register Offset */
#define ETH_SCRT2ET3_REG_OFST          _UINT32_(0x16EC)    /* (ETH_SCRT2ET3) Screening Type 2 EtherType Register Offset */
#define ETH_SCRT2ET4_REG_OFST          _UINT32_(0x16F0)    /* (ETH_SCRT2ET4) Screening Type 2 EtherType Register Offset */
#define ETH_SCRT2ET5_REG_OFST          _UINT32_(0x16F4)    /* (ETH_SCRT2ET5) Screening Type 2 EtherType Register Offset */
#define ETH_SCRT2ET6_REG_OFST          _UINT32_(0x16F8)    /* (ETH_SCRT2ET6) Screening Type 2 EtherType Register Offset */
#define ETH_SCRT2ET7_REG_OFST          _UINT32_(0x16FC)    /* (ETH_SCRT2ET7) Screening Type 2 EtherType Register Offset */

